Revit 2020 API
FabricationConfiguration.GetMaterialThickness Method
 Gets material thickness from its material/gauge identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2017
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use FabricationPart MaterialThickness property instead.")]
public double GetMaterialThickness(
	int materialId,
	int gaugeId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use FabricationPart MaterialThickness property instead.")> _
Public Function GetMaterialThickness ( _
	materialId As Integer, _
	gaugeId As Integer _
) As Double
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2020 and will be removed in the next version of Revit. We suggest you instead use FabricationPart MaterialThickness property instead.")]
public:
double GetMaterialThickness(
	int materialId,
	int gaugeId
)
Parameters
materialId
Type: System.Int32
 The material identifier.
gaugeId
Type: System.Int32
 The gauge identifier within the specified material.
Return Value
 The thickness of the material/gauge.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace